{
"userquestion": "Who killed a UDF supporter in 1958?",
"language":"en",
"allquestionsinDB": [
        "An ANCYL member who was shot and severely injured by SAP members at Lephoi, Bethulie, Orange Free State (OFS) on 17 April 1991. Police opened fire on a gathering at an ANC supporter's house following a dispute between two neighbours, one of whom was linked to the ANC and the other to the SAP and a councillor.",
        "A member of the SADF who was severely injured in a landmine explosion in Messina, Transvaal, on 5 May 1987.",
        "A member of QIBLA who disappeared in September 1988 after fleeing the country for political reasons. He had been detained several times before he left South Africa.",
        "A COSAS supporter who was kicked and beaten with batons and rifle-butts by members of the Ciskei Police during protests against the Ciskei government at Zwelitsha and Mdantsane, Ciskei, in September 1985.",
        "Was shot and blinded in one eye by members of the SAP in Athlone, Cape Town, in August 1976, after the Soweto uprising.",
        "Was shot and injured by members of the SAP in Robertson, Cape, on 11 April 1990. Police fired teargas into a crowded hall where residents were meeting. Over one hundred people were treated for injuries relating to the subsequent stampede and shootings.",
        "Was shot and injured by members of the Railway Police on 15 October 1985 in Athlone, in the Trojan Horse incident, Cape Town.",
        "A street committee member who was shot dead by members of the SAP at Gelvandale, Port Elizabeth, on 3 September 1990.",
        "An MK member who went into exile in 1968. His family last heard from him in 1975 and has received conflicting information from the ANC regarding his fate. The Commission was unable to establish what happened to Mr Abrahams, but he is presumed dead.",
        "Was stabbed and stoned to death by a group of UDF supporters in Mitchells Plain, Cape Town, on 25 May 1986, during a UDF rally following allegations that he was an informer. UDF leaders attempted to shield him from attack, but Mr Abrahams fled the venue. He was then pursued and killed.",
        "Was burnt to death, together with a colleague, when their vehicle was stoned and petrol bombed by protesting youths near Crossroads, Cape Town, on 28 April 1986. Both were employees of an electrical firm and were returning to their office when they were attacked.",
        "Was shot and injured by members of the Railway Police on 15 October 1985 in Athlone, Cape Town, during the Trojan Horse incident. See Trojan Horse incident, Cape Town. ",
        "Was severely injured when MK operatives detonated an explosive outside the South African Air Force (SAAF) headquarters in Church Street, Pretoria, on 20 May 1983. Twenty one people were killed and two hundred and seventeen were injured. The overall commander of MK’s Special Operations Unit and two MK operatives were granted amnesty (AC/2001/003 and AC/2001/023). See Church Street Bombing, Pretoria. ",
        "Was injured when APLA operatives threw hand grenades at and opened fire on the congregation of St James’ Church, Kenilworth, Cape Town, on 25 July 1993. Eleven people were killed and fifty eight wounded in the attack.  Three of four APLA members were granted amnesty for the attack. The fourth had his application struck off the roll for failing to attend the amnesty hearing (AC/1998/0018). See APLA attacks. ",
        "Was shot and killed when APLA operatives threw hand grenades at and opened fire on the congregation of St James’ Church, Kenilworth, Cape Town, on 25 July 1993. Eleven people were killed and fifty eight wounded in the attack. Three of four APLA members were granted amnesty for the attack. The fourth had his application struck off the roll for failing to attend the amnesty hearing (AC/1998/0018). See APLA attacks. ",
        "Was injured when MK operatives detonated an explosive in a car outside the South African Air Force (SAAF) headquarters in Church Street, Pretoria, on 20 May 1983. Twenty one people were killed and two hundred and seventeen were injured. The overall commander of MK’s Special Operations Unit and two MK operatives were granted amnesty (AC/2001/003 and AC/2001/023). See Church Street Bombing, Pretoria.)",
        "A UDF supporter who was shot dead by members of the Municipal Police at New Brighton, Port Elizabeth, on 14 February 1987.",
        "A UDF supporter who was shot dead by members of the Municipal Police at New Brighton, Port Elizabeth, on 14 February 1987.",
        "Was severely beaten and shot in the leg in Guguletu, Cape Town, in 1986, during political conflict between Witdoeke vigilantes from Crossroads and UDF supporters in KTC.",
        "A UDF organiser who was detained for three days during a consumer boycott in Graaff-Reinet, Cape, in June 1985. In detention he was beaten by named members of the SAP. From June to December 1985, he was held at Middelburg Prison, Cape.",
        "Was injured when the car in which he was travelling was petrol bombed in Khayelitsha, Cape Town, on 15 April 1993, during widespread protest and unrest following the killing of SACP leader, Chris Hani. His brother-in-law was burnt to death and one person was injured in the attack.",
        "A UDF supporter who was subjected to psychological torture by members of the SAP while in police custody in Graaff-Reinet, Cape, during the 1985 school boycotts.",
        "Was shot dead by members of the SAP in Athlone, Cape Town, on 16 September 1976, while she was standing on the balcony of her third floor flat watching police action against protesters after the Soweto uprising.",
        "A UDF supporter and member of the BMW who was detained in 1986 and again in July 1987 when he was held for nine months and severely tortured by named members of a special police Unrest Investigation Unit.",
        "An ANCYL supporter who was detained and severely beaten by members of the SAP at the Grootvlei police station in Reddersburg, Orange Free State, in May 1990. This took place during a local boycott, during which time several youth activists were assaulted and tortured by the police.",
        "A member of the BMW who was arrested in Bonteheuwel, Cape Town, in 1988, and tortured by named members of a special police Unrest Investigation Unit.",
        "An ANC supporter who was shot and injured when members of the SAP opened fire on a crowd of people participating in a protest march in Olifantshoek, Cape, on 16 June 1992.",
        "Was shot dead by members of the SAP in Hanover Park, Cape Town, on 2 September 1976. He was on his way to buy bread during the political unrest following the Soweto uprising.",
        "A cleric and chairperson of the Pietermaritzburg Council of Churches who was shot dead in Imbali, Pietermaritzburg, on 4 May 1990 while taking his child to school. A named Inkatha member was convicted for the murder, but was later acquitted on appeal.",
        "Was shot and injured by a named SAP member in Kakamas, Cape, on 13 February 1988. The perpetrator opened fire on residents outside a house being raided by police. Two children were shot dead and thirteen people injured.",
        "Was detained by alleged members of the SAP at Ipelegeng, Schweizer-Reneke, Transvaal, in March 1990.",
        "Was shot and injured by named SAP members during a legal protest march in Wolseley, Cape, on 24 November 1990.",
        "Was shot dead by members of the SAP in Montagu, Cape, on 11 September 1976. He was in a vehicle with other protesters when he was shot at after the Soweto uprising had spread to a number of rural Cape towns.",
        "As the mother of Neil Aggett, who died in detention, Joyce was subjected to an unlawful search of her home in Somerset West, Cape, in her absence, by the Witwatersrand Security Branch, during April 1982. One Security Branch operative was granted amnesty for the unlawful search (AC/2001/005). He testified that he had been gathering evidence to be used at the inquest into Dr Aggett’s death, in order to support the Security Police’s contention that Dr Aggett had committed suicide.",
        "Died in detention at John Vorster Square, Johannesburg, on 5 February 1982, following a period of torture, including sixty consecutive hours of interrogation and two months of solitary confinement. Mr Aggett was the Transvaal Secretary for the Food and Allied Workers Union. ",
        "Was beaten by members of the SAP in April 1985 during consumer boycotts at Jansenville, Cape.",
        "Was beaten by members of the SAP in April 1985 during consumer boycotts at Jansenville, Cape.",
        "Was beaten and stabbed to death on 10 December 1992 in Entshawini, KwaZulu, near Stanger, Natal, by named IFP supporters who thought she was an ANC supporter.",
        "An ANC supporter who suffered extensive damage to his home and business premises in an explosion triggered by the opening of a booby-trapped computer on 2 October 1990 in Durban. One person was killed in the attack, allegedly carried out by named right-wing extremists.",
        "Was arrested after arson attacks on the homes of vigilantes in Zolani, Ashton, Cape, on 20 November 1985. She was convicted of arson and public violence in September 1986 and sentenced to eight years’ imprisonment.",
        "Was attacked with stones by UDF supporters in his home at KwaMandlenkosi, Beaufort West, Cape, on 25 January, 1985. Three days earlier, a UDF organiser had been shot dead by police, leading to unrest and attacks on perceived collaborators in the township. Mr Allam’s house was destroyed by fire during the attack. ",
        "Her home was destroyed in an arson attack by UDF supporters in Kwa-Mandlenkosi, Beaufort West, Cape, on 25 January 1985. Three days earlier, a UDF organiser had been shot dead by police, leading to an eruption of unrest and attacks on perceived collaborators in the township. Her two children were stoned and injured in the attack.",
        "Was attacked with stones by UDF supporters in her home at KwaMandlenkosi, Beaufort West, Cape, on 25 January, 1985. Three days earlier, a UDF organiser had been shot dead by police, leading to unrest and attacks on perceived collaborators in the township. Ms Allam’s house was destroyed by fire during the attack.",
        "Was shot dead by members of the SAP in Ravensmead, Cape Town, on 7 September 1976, after the Soweto uprising.",
        "Was injured when MK operatives detonated a limpet mine in a dustbin at the Vanderbijl Square bus terminus, Johannesburg, on 21 September 1988. Nineteen people were injured and a number of vehicles and buildings were damaged. Two MK Special Operations operatives were granted amnesty (AC/2000/056). A late application by a third MK operative was dismissed.",
        "He was an MK operative who was shot dead in an ambush at Alldays, Transvaal, near the Botswana border, on 10 July 1986 by a joint team comprising SADF Special Forces and Far Northern Transvaal Security Branch members. Fourteen Security Branch operatives, including the divisional commander, applied for amnesty. Nine of these applications were refused (AC/1999/0176).",
        "A UDF supporter who was burnt to death by a named perpetrator during a consumer boycott in KwaNobuhle, Uitenhage, Cape, on 14 September 1985, after he was accused of being a state collaborator.",
        "Was injured in a hand grenade explosion in Kimberley, Cape, on 25 May 1993, during an ANC protest march to the Bophuthatswana consulate. Two MK operatives threw a hand grenade at the building, but it bounced back into the crowd, killing one person and injuring forty one others. Two ANC members were wrongly convicted of the killing. Four MK and ANC members, two of whom denied guilt, applied for amnesty, which was refused (AC/2000/053 and AC/2000/241).",
        "Was injured when members of MK’s Special Operations Unit detonated an explosive in a car outside the SADF Witwatersrand Command headquarters in Johannesburg on 30 July 1987. At least sixty eight people were injured. Three MK operatives and one UDF supporter linked to MK were granted amnesty for their roles in this attack (AC/2001/0003 and AC/2000/248).",
        "Amthenja disappeared with his brother, Eric Msimango, while travelling from Tokoza, Transvaal, to Pretoria, on 20 November 1993. An IFP march from Johannesburg to Pretoria was in progress at the time. He has never been seen since and is presumed dead.",
        "Was shot dead in the Silverton bank siege in Pretoria, on 25 January 1980. Three MK members held her hostage during a raid on the bank. Ms Anderson, one other civilian and the three MK members were all killed during a gunfight after police stormed the bank. Several other people were injured.",
        "A trade unionist in Johannesburg who was banned in 1976 and subjected to ongoing harassment during March 1977. A Witwatersrand Security Branch operative was granted amnesty for harassment (AC/2001/005).",
        "Was shot and killed when APLA operatives threw hand grenades at and opened fire on the congregation of St James’ Church, Kenilworth, Cape Town, on 25 July 1993. Eleven people were killed and fifty eight wounded in the attack. Three of four APLA members were granted amnesty for the attack. The fourth had his application struck off the roll for failing to attend the amnesty hearing (AC/1998/0018). See APLA attacks. ",
        "Was injured when MK operatives detonated an explosive in a car outside the South African Air Force (SAAF) headquarters in Church Street, Pretoria, on 20 May 1983. Twenty one people were killed and two hundred and seventeen injured. The overall commander of MK’s Special Operations Unit and two MK operatives were granted amnesty (AC/2001/003 and AC/2001/023). See Church Street Bombing, Pretoria. ",
        "Was arrested with ten friends on 16 June 1986 in Carnavon, Cape, for wearing black ties commemorating those who died in the Soweto uprising. He was repeatedly beaten by named members of the SAP at the police station and detained for seventy two days under emergency regulations in Carnarvon, and then in Victor Verster prison, Paarl, Cape. See police brutality.",
        "A municipal policeman who was shot dead by UDF and ANC supporters near the Langa police station, Uitenhage, Cape, on 20 April 1990. Two UDF/ANC supporters were granted amnesty for the incident (AC/99/0280).",
        "Was shot and injured by members of the SAP in Paarl, Cape, on 9 September 1976, while walking in the street. Three women were shot dead in Paarl that day, after the Soweto uprising had spread to the Cape.",
        "Was injured when he was shot in the back by SAP members in Wolseley, Cape, on 24 November 1990, during a legal community protest.",
        "Was shot and killed when APLA operatives threw hand grenades at and opened fire on the congregation of St James’ Church, Kenilworth, Cape Town, on 25 July 1993. Eleven people were killed and fifty eight wounded in the attack. Three of four APLA members were granted amnesty for the attack. The fourth had his application struck off the roll for failing to attend the amnesty hearing (AC/1998/0018). See APLA attacks. ",
        "A NUSAS activist who was detained on 16 June 1980 and held in solitary confinement for eight and a half weeks in Caledon Square police station, Cape Town.",
        "Was shot through the head and killed on 15 November 1988 by members of the SADF in Pietersburg, Transvaal. Mr Anthony was allegedly killed because he had seen confidential information while working for the SADF.",
        "A BCM member who was arrested in connection with the killing of a suspected collaborator in Port Elizabeth on 20 September 1977. While in detention, he was assaulted by members of the SAP.",
        "An AZAPO member who was ‘necklaced’ to death by COSAS and UDF supporters in Port Alfred, Cape, in June 1985, during political conflict between the UDF and AZAPO in the area. Several other AZAPO members were assaulted and injured in the attack.",
        "A member of the Baha’i faith community who died when he and two others were shot and killed by APLA operatives at the Baha’i Faith Centre, Mdantsane, Ciskei, on 13 March 1994. The victims, though of Iranian extraction, were allegedly regarded by the perpetrators as ‘whites’. A vehicle was also stolen during the attack. Two perpetrators were granted amnesty (AC/2001/271). See APLA attacks. ",
        "Was injured when MK operatives detonated an explosive in a car outside the South African Air Force (SAAF) headquarters in Church Street, Pretoria, on 20 May 1983. Twenty one people were killed and two hundred and seventeen were injured. The overall commander of M K ’s Special Operations Unit and two MK operatives were granted amnesty (AC/2001/003 and AC/2001/023). See Church Street Bombing, Pretoria. ",
        "An ANC member whose house and tuck shop in Sekampaneng, Hammanskraal, Transvaal, were demolished on 8 February 1993 by members of the Bophuthatswana Police, who were acting on an eviction order from the Bophuthatswana government.",
        "A COSAS supporter who was tortured in detention in September 1986 in Middelburg prison, Transvaal, during student unrest in the area.",
        "An ANC supporter who died when an IFP member assaulted him and threw him from a moving train in the Johannesburg area on 29 November 1991. One perpetrator was granted amnesty (AC/1999/0256). See train violence.",
        "Was arrested in September 1986 by the SAP and imprisoned in Motetema, Lebowa. The police were apparently seeking her brother because of his affiliation to COSAS.",
        "A UDF supporter who was shot dead by a member of the SAP in Zwide, Port Elizabeth, on 7 October 1986 during the State of Emergency. A 1987 inquest concluded that no one was responsible for her death. See police brutality.",
        "A UDF supporter who was shot in the hand during conflict between AZAPO and UDF supporters in Zwide, Port Elizabeth, on 12 May 1985.",
        "An ANC supporter who was shot and injured by IFP-supporting hostel-dwellers in Swanieville, near Krugersdorp, Transvaal, on 12 May 1991. About one hundred and fifteen shacks were set alight, twenty seven people killed and twenty five vehicles burnt in retaliation for the expulsion of IFP supporters from the area. Twelve people were charged with crimes ranging from murder to arson, but were later acquitted due to lack of evidence.",
        "A UDF supporter and SRC representative who was beaten and tortured during his three-month detention under emergency regulations in Carnarvon, Cape, from July 1986. He was later charged with arson and sentenced to a suspended prison term. See police brutality.",
        "Was injured on 22 August 1985 when the coulcillor’s house she was visiting in KwaMandlenkosi, Beaufort West, Cape, was set on fire.",
        "A UDF activist who lost both his eyes after being shot by a named off-duty SAP member in Addo, Cape, on 13 April 1985, while he was publicising a meeting. Upon his discharge from hospital, Mr Appolis was detained in North End Prison, Port Elizabeth.",
        "An ANC supporter who was severely beaten and tortured by CDF and Peace Force members in Stutterheim, Cape, on 7 September 1992.",
        "Was tortured repeatedly by members of the SAP at Carletonville police station, on 24 November 1985, during a rent boycott in Khutsong, Carletonville, Transvaal.",
        "Was shot and injured by members of the SADF on 15 June 1986 in Nelspruit, Transvaal, during a night vigil held to commemorate the 1976 Soweto uprising.",
        "An ANC supporter who was shot dead by a member of the SAP in Daveyton, Benoni, Transvaal, on 13 April 1986.",
        "Died after being assaulted with a rock by named members of the SAP in Lingelethu, Adelaide, Cape, on 16 April 1986. One of the perpetrators was found guilty of the killing.",
        "A COSAS supporter who was repeatedly tortured and held in solitary confinement for two months from 5 April 1986 at Addo police station, Cape.",
        "A PAC supporter who was tortured by members of the SAP in Willowvale, Transkei, in April 1963, during the state of emergency. See police brutality.",
        "A PAC supporter who was kicked, clubbed with guns and spat upon throughout an entire night by members of the SAP when he was detained at Willowvale, Transkei, in 1963.",
        "A UDF supporter in Bonteheuwel, Cape Town who was detained in June 1986 and held under emergency regulations for several months at Victor Verster prison, Paarl. Thereafter he experienced continuous police harassment and several arrests. See police brutality.",
        "An ANC supporter who was arrested and severely beaten by a member of the SAP at Uitenhage, Cape, in 1991.",
        "A school student who was detained during a protest march in Woodstock, Cape Town, on 3 September 1976. He was severely beaten and detained for almost a year without trial. On 10 November 1985 he was shot and injured by police during unrest in Mitchells Plain, Cape.",
        "Was injured in what became known as the Magoo’s Bar Booming in Durban on 14 June 1986. The explosion killed three women and injured at least seventy four other people. Seven MK operatives were granted amnesty (AC/2001/128).",
        "Was in her home in Cradock, Cape, when it was stoned and petrol bombed by unidentified youths in 1985. The attack is believed to have taken place because her son was a policeman.",
        "A UDF supporter who was severely beaten by members of the SAP at Colesberg police station, Cape, in August 1986, and again in 1988, because of his alleged involvement in the campaign against the municipal elections.",
        "An ANC supporter who had her house burnt down on 20 March 1994 in Sonkombo, Ndwedwe, KwaZulu, near Durban, in intense political conflict in the area. See Sonkombo arson attacks.",
        "Was shot dead by two men at his surgery in Rockville, Soweto, Johannesburg, on 27 January 1989. Dr Asvat was allegedly killed because he had knowledge about numerous assaults that took place at Ms Winnie Madikizela-Mandela’s home in Orlando West, Soweto, including the death of youth activist, Stompie Seipei.",
        "Co-owner and manager of the Heidelberg Tavern situated in Observatory, Cape Town, who suffered damages when APLA operatives attacked the tavern with a rocket launcher and automatic weapons on 30 December 1993. Four people were killed and seven were injured during the course of the attack. Three perpetrators were granted amnesty (AC/1998/0026). See APLA attacks.",
        "Was beaten and shot by members of the SAP at a bus stop in Kanana, Orkney, Transvaal, during a strike on 16 March 1986.",
        "Was at home in KwaGuqa, Witbank, Transvaal, when it was bombed by a member of the SAP in March 1986. The incident took place during a period of heightened political conflict which soon led to the imposition of a state of emergency.",
        "A youth congress activist and ANC supporter who was severely beaten by members of the SAP at a school in Fort Beaufort, Cape, during the 1980s school boycotts. He was subsequently arrested and detained on numerous occasions during the 1980s, and subjected to severe torture by named SAP members. He was imprisoned and released in 1992, after which he was severely assaulted during violent conflict between ANC and PAC supporters in Fort Beaufort, Cape.",
        "An ANC supporter who was beaten by police upon his arrest with more than seventy other youths in Robertson, Cape, on 20 November 1985. Mr August was again beaten by police on 18 June 1986 and thereafter detained for three months under emergency regulations. See police brutality.",
        "An ANC supporter who had her home destroyed in an arson attack by PAC supporters during political conflict at Fort Beaufort, Cape, on 24 February 1993.",
        "Was arrested and beaten with sjamboks and batons by SAP members near Worcester, Cape, on 18 June 1986. He was then detained for three months in Victor Verster prison, Paarl, Cape, under emergency regulations. See police brutality.",
        "Was severely injured when members of MK’s ‘Dolphin unit’ detonated an explosive in a car near the Krugersdorp Magistrate’s court and the adjacent police station, Transvaal, on 16 March 1988. Three people were killed and more than twenty were injured in the blast. Two MK operatives were granted amnesty (AC/2001/003).",
        "Suffered severe trauma when APLA operatives, armed with automatic weapons and hand grenades, stormed the Yellowwoods Hotel, in Fort Beaufort, Cape, on 23 March 1993, and opened fire on staff and patrons. One person was shot dead in the attack. Three perpetrators were granted amnesty (AC/2000/225). See APLA attacks.",
        "Was interrogated, tortured and killed by AZAPO members along with five other scholars in Soweto, Johannesburg, on 1 August 1986. The incident was sparked off by the burning of the house of an AZAPO leader for which the youths were believed to have been responsible. Three perpetrators were refused amnesty, and one was granted amnesty (AC/2000/179 and AC/1999/230).",
        "An ANC supporter who was detained in 1974 under Section 6 of the Terrorism Act. He was severely tortured by named Security Branch members at the Greenwood Park and Fischer Street police stations in Durban. During interrogations he was kicked until he was unconscious.",
        "Was injured in a hand grenade explosion in Kimberley, Cape, on 25 May 1993, during an ANC protest march to the Bophuthatswana consulate. Two MK operatives threw a hand grenade at the building, but it bounced back into the crowd, killing one person and injuring forty one others. Two ANC members were wrongly convicted of the killing. Four MK and ANC members, two of whom denied guilt, applied for amnesty, which was refused (AC/2000/053 and AC/2000/241).",
        "An ANC member and trade union organiser who was detained and tortured by members of the SAP in East London during 1963. She was held in solitary confinement for a year in North End prison, Port Elizabeth, and then sentenced to five years’ imprisonment, which she served in Kroonstad prison. On her release in 1969 she was banished to Mabopane, near Pretoria.",
        "Was arrested in Molteno, Cape, in February 1965 and severely tortured by named members of the SAP at the police station in Burgersdorp, Cape. He was then imprisoned on Robben Island, Cape Town, for twelve years.",
        "Her home was petrol bombed in Nyanga, Cape, on 9 November 1977, in the violent aftermath of the Soweto uprising. Her infant daughter was killed and her son seriously injured in the attack.",
        "An ANC member from Worcester, Cape, who was banished to Zululand in 1959. He fled to Swaziland in 1961. He was deported to Tanzania in 1984 when the Swaziland government banned the ANC from operating on Swazi territory.",
        "Was burnt to death when her parents’ house was petrol bombed in Nyanga, Cape Town, on 9 November 1977, in the aftermath of the Soweto Uprising. The attack was allegedly carried out by school students, who considered Grace’s father to be a traitor because he was an Afrikaans teacher.",
        "A UDF supporter who was beaten, stabbed, and had his left ear and fingers burnt off in an attempted ‘necklacing’ by other UDF supporters at Fort Beaufort, Cape, on 13 April 1985. Mr Baartman was accused of being a collaborator.",
        "Was severely burnt and injured when his parents’ house was petrol-bombed in Nyanga, Cape Town, on 9 November 1977, in the aftermath of the Soweto Uprising. His face and hands were left severely deformed. The attack was allegedly carried out by school students, who considered William’s father to be a traitor because he was an Afrikaans teacher.",
        "Was shot and injured in his home in Tembisa, Transvaal, on 3 March 1991 by IFP supporters allegedly supported by SADF members. The Baas home was attacked because the area’s Xhosa-speaking residents were assumed to be ANC supporters.",
        "Was shot dead by IFP supporters during an attack on her home in Tembisa, Kempton Park, Transvaal, on 3 March 1991. The Baas home was attacked because the area ’s Xhosa-speaking residents were assumed to be ANC supporters.",
        "Was shot and injured by IFP supporters during an attack on her home in Tembisa, Kempton Park, Transvaal, on 3 March 1991. Ms Baas’s children were also shot during the incident. The Baas home was attacked because the area ’s Xhosa speaking residents were assumed to be ANC supporters.",
        "Was beaten to death by a named perpetrator during political conflict in Port Elizabeth on 23 August 1974.",
        "Was shot dead on 15 July 1985 by named members of the Security Branch and the SAP during the 1985 school boycotts in Masizakhe, Graaff-Reinet, Cape.",
        "Was shot and injured by SAP members who were dispersing a march in Ashton, Cape, on 17 May 1989.",
        "Was shot dead by members of the SAP during protests in Soweto, Port Elizabeth, on 23 July 1986.",
        "An ANCYL supporter who was detained, tortured and interrogated by members of the Ciskei Security Police at Peddie, Ciskei, in June 1992, allegedly for information regarding MK operatives and their meetings. He was released only when he promised to consider becoming an informer.",
        "Was shot dead during a shoot-out between the ANC and the IFP at a political rally at King Zwelethini Stadium in Umlazi, Durban, in February 1992.",
        "Was one of several people tortured by named SAP members in Huhudi, Vryburg, Cape, on 16 June 1986, following a commemoration service for victims of the Soweto uprising in June 1976. The detainees were tortured at Vryburg police station and then interrogated at a farm called Blou Gom.",
        "Was severely beaten by members of the Bophuthatswana Police while protecting the SRC president during a student protest at the University of the North West in Mafikeng, on 7 May 1993.",
        "An ANC supporter who was found hanged in his cell while serving a fourteen-year sentence at Kirkwood Prison, Cape, in 1988. Mr Bacela had been convicted of a killing that took place during a consumer boycott in 1987.",
        "A UDF supporter who was injured in a drive-by shooting by named members of the Municipal Police during protests over the Black Local Authority in Fort Beaufort, Cape, on 30 November 1985.",
        "An AZASM supporter who was detained for four days under the Internal Security Act and severely beaten by named members of the Security Branch near Worcester, Cape, in June 1983.",
        "A journalist, ANC supporter and PEBCO leader who was detained and tortured by members of the SAP in North End prison, Port Elizabeth, on 6 April 1963, and again at Kirkwood police station in January 1980. On 1 November 1984 he was detained at the St Alban’s prison under the Internal Security Act, and kept in solitary confinement. His house was petrol bombed on 5 June 1985 and he was abducted and severely assaulted by AZAPO members during the conflict between AZAPO and UDF in Port Elizabeth in 1985. A former Security Police agent was refused amnesty for the petrol-bombing of his home (AC/2000/239).",
        "A UDF supporter who was shot and injured by named members of the SAP during conflict between AZAPO and UDF supporters in Port Elizabeth on 18 May 1985.",
        "An ANC underground member who was shot several times and severely injured in an attack by members of the CDF at his home in Msobomvu, Alice, Ciskei, on 15 October 1992. He escaped, but three members of his family were killed and his house was destroyed.",
        "An ANC supporter who was shot in the legs by members of the CDF at her home in Msobomvu, Alice, Ciskei, on 15 October 1992. Three members of her family were killed in the attack and the house was destroyed.",
        "Was shot dead by members of the CDF at her home in Msobomvu, Alice, Ciskei, on 15 October 1992. Two other members of her family were killed in the attack and the house was destroyed.",
        "Was shot dead by members of the CDF at her home in Msobomvu, Alice, Ciskei, on 15 October 1992. Two other members of her family were killed in the attack and the house was destroyed.",
        "An ANC supporter who is believed to have been abducted on 7 October 1992 on his way home to Alexandra, Johannesburg, and killed. Several Transvaal townships were engulfed in political conflict between IFP and ANC supporters at the time.",
        "Was shot dead outside a clinic in Kanana, Orkney, Transvaal, on 5 April 1986 by members of the SAP who suspected him of burning businesses in the area during political conflict.",
        "Was shot and injured when APLA operatives threw hand grenades at and opened fire on the congregation of St James’ Church, Kenilworth, Cape Town, on 25 July 1993. Eleven people were killed and fifty eight wounded in the attack. Three of four APLA members were granted amnesty for the attack. The fourth had his application struck off the roll for failing to attend the amnesty hearing (AC/1998/0018). See APLA attacks. ",
        "A student activist and UDF supporter who was shot dead by named members of the Security Branch in Zweletemba, Worcester, Cape, on 16 August 1985. Mr Bahume’s funeral on 30 August was placed under restriction orders by the police, who then opened fire on mourners, killing a youth. ",
        "Survived an attack by SADF Special Forces and Vlakplaas operatives on homes at Ditlharapeng village, Ramathlabama, Botswana, one thousand metres from the South African border, on 11 December 1988. An MK operative and a fifteen-year-old boy were killed and three homes were destroyed. The Vlakplaas commander and eight of his operatives were granted amnesty for their role in the operation (AC/2001/108).",
        "Was walking in the street on 30 April 1993 when named Bophuthatswana Police members fired teargas and shot and injured him during a raid on ANC supporters at Seoding Village, Kuruman, Cape.",
        "Was one of two young boys shot dead by a named member of the SAP in Mitchells Plain, Cape Town, on 29 August 1985. At least twenty eight people were shot dead by police in the wake of the Pollsmoor march.",
        "A PAC activist who was arrested and assaulted by members of the SAP after giving first aid to people wounded in the Sharpeville massacre, in Sharpeville, Vereeniging, Transvaal, on 21 March 1960.",
        "An ANC and UDF supporter from Mitchells Plain, Cape Town, was detained for three days by members of the Security Police in November 1985. The following year he was convicted of furthering the aims of the ANC.",
        "A UDF supporter who was severely beaten on the head by named members of the SAP while in detention in Fort Beaufort, Cape, on 16 June 1985. He suffered a burst eardrum and hearing loss as a result.",
        "Was repeatedly assaulted with sjamboks and thrown against the wall by named members of the SAP during a week’s detention at Bedford police station, Cape, in March 1985. She was detained in Grahamstown for six months in June 1986 during the state of emergency and consumer boycotts in the area. See police brutality. ",
        "Was shot and wounded in Germiston, Transvaal, on 3 February 1993 by members of an ANC self-defence unit (SDU) who robbed her and her companion of the vehicle in which they were travelling. Her companion was shot dead. The SDU members were allegedly seeking a vehicle in which to transport weapons. One SDU member was granted amnesty (AC/1998/0058).",
        "One of ten students arrested at a rally in Athlone, Cape Town, on 17 September 1985, and detained for twenty four hours at the Brackenfell police station. During his arrest, detention and interrogation he was severely beaten, suffocated and forced to perform physical exercises for several hours by named and other members of the SAP.",
        "A scholar who was shot dead when members of the SAP fired at protesters who gathered in KwaNobuhle, Uitenhage, Cape, on 12 April 1993 after the killing of political leader, Chris Hani.",
        "A member of the Baha’I faith community who died when he and two others were shot and killed by APLA operatives at the Baha’i Faith Centre, Mdantsane, Ciskei, on 13 March 1994. The victims, though of Iranian extraction, were allegedly regarded by the perpetrators as ‘whites’. A vehicle was also stolen during the attack. Two perpetrators were granted amnesty (AC/2001/271). See APLA attacks. ",
        "Had her house burnt down by IFP supporters at Gamalakhe, KwaZulu, near Port Shepstone, Natal, on 20 June 1993 in intensified political conflict in the area.",
        "Was shot and wounded in the foot by members of the SAP outside her house in White City, Soweto, Johannesburg, on 26 August 1986 during rent boycotts.",
        "Was injured in a hand grenade explosion in Kimberley, Cape, on 25 May 1993, during an ANC protest march to the Bophuthatswana consulate. Two MK operatives threw a hand grenade at the building, but it bounced back into the crowd, killing one person and injuring forty one others. Two ANC members were wrongly convicted of the killing. Four MK and ANC members, two of whom denied guilt, applied for amnesty, which was refused (AC/2000/053 and A/C/2000/241)",
        "An activist in the Women ’s Forum in Mossel Bay, Cape who was detained on 16 June 1986 and held for three months under emergency regulations at George police station, Cape, where she was severely ill-treated. See police brutality. ",
        "An ANC supporter who was assaulted by members of the SAP after her arrest on 11 October 1986 in Port Elizabeth. She was then detained for eight months, and interrogated about the activities of her ‘comrades’.",
        "An ANC supporter who was severely beaten by members of the Bophuthatswana Police on 1 January 1994, when they detained her for five days in Pampierstad, Bophuthatswana.",
        "Was detained for two weeks at the Pampierstad police station, Bophuthatswana, on 1 January 1994 during a spontaneous community march in support of the first democratic elections to be held in April 1994. Marchers were assaulted by alleged members of the Bophuthatswana Police. There was a court case held subsequently and all the marchers were acquitted.",
        "An MK operative who was shot dead by askaris and members of the Eastern Cape Security Police, on 22 February 1990 in Guguletu, Cape Town. A hand grenade was then planted on Mr Baloi in order to justify his killing.",
        "Was tied to the back of a van and pulled through the veld by a named member of the ISU in Kagiso, Transvaal, in June 1986.",
        "An ANC supporter who was shot dead, allegedly by members of the ISU, in Tokoza, Transvaal, on 19 April 1994 in political conflict in the area during the run-up to the April 1994 elections.",
        "Was shot and injured by a member of the SAP in Mamelodi, Pretoria, during a protest march on 21 November 1985.",
        "A PAC member from Pietersburg, Transvaal who was detained and tortured in March 1965. He was subsequently sentenced to three years’ imprisonment for furthering the aims of the banned PAC. During his imprisonment at Baviaanspoort and Barberton, he was subjected to both physical and psychological torture.",
        "Lost his home and shop in an arson attack by supporters of Chief Simon Shongoane in Ellisras, Transvaal, on 6 March 1981.",
        "Was attacked with pangas and axes by supporters of Chief BK Matlala in a field in GaMatlala, Lebowa, in January 1980, because Mr Baloyi resisted Lebowa’s proposed independence.",
        "Was injured in an arson attack on his home in Pretoria on 11 April 1986 by members of the SAP because his son was politically active.",
        "Was killed when a pipe bomb planted by members of the AWB exploded on 25 April 1994 at a taxi rank on the corner of Blood Street and Seventh Avenue in Pretoria. Three people were killed and four injured in the blast. Six perpetrators were granted amnesty (AC/1999/0342). See right-wing attacks.",
        "Was severely beaten by members of the SAP in Machadodorp, Transvaal, on 4 August 1992. Police suspected Mr Baloyi of involvement in a stayaway.",
        "Was severely beaten by members of the SAP in Machadodorp, Transvaal, on 4 August 1992. Police suspected Mr Baloyi of involvement in a stayaway.",
        "Was stoned to death by ANC supporters and residents of Gandlanani village, Giyani, Gazankulu, on 24 February 1990. His brother was injured in the attack. The applicants testified that they believed that Mr Baloyi’s brother was an inyanga, a sorcerer, and that witchcraft was used to impede the struggle for liberation. Two ANC supporters were granted amnesty for the attack (AC/2001/073).",
        "Was stoned to death by ANC supporters and residents of Gandlanani village, Giyani, Gazankulu, on 24 February 1990. His brother was injured in the attack. The applicants testified that they believed that Mr Baloyi’s brother was an inyanga, a sorcerer, and that witchcraft was used to impede the struggle for liberation. Two ANC supporters were granted amnesty for the attack (AC/2001/073).",
        "Had his house destroyed by IFP supporters during the Boipatong massacre in Boipatong, near Vanderbijlpark, Transvaal, on 17 June 1992, which left 45 people dead and 27 seriously injured. Thirteen perpetrators were granted amnesty; a further three applications were refused (AC/2000/209).",
        "He had his house destroyed by IFP supporters during the Boipatong massacre in Boipatong, near Vanderbijlpark, Transvaal, on 17 June 1992, which left forty five people dead and twenty seven seriously injured. Thirteen perpetrators were granted amnesty; a further three applications were refused (AC/2000/209).",
        "Was killed by members of the SAP in Nelspruit, Transvaal, on 14 July 1988.",
        "Was detained for two weeks in Lebowakgomo police station in Pietersburg, Transvaal, allegedly by members of the SADF in August 1992.",
        "Was one of eighteen people injured in a limpet mine explosion at a bus stop near the Checkers shopping complex in Silverton, Transvaal, on 4 July 1986. Four MK operatives were granted amnesty for the attack (AC/1999/0257).",
        "The mother of a political activist who was severely burnt when members of the SAP petrol-bombed her home in Pretoria, on 11 April 1986.",
        "Was killed by SADF members in Temba, Bophuthatswana, on 11 March 1994. Political tension was high in the area in the run-up to the April 1994 elections.",
        "Was assaulted by members of the SAP in Pretoria, on 19 March 1986 during school boycotts because he was accused of having killed a policeman in Soshanguve, Pretoria.",
        "He sustained injuries when he was stoned and his property burnt down by ANC supporters and residents of Gandlanani village, Giyani, Gazankulu, on 24 February 1990. Mr Baloyi’s brother was killed in the attack. The applicants testified that they believed that Mr Baloyi was an inyanga, a sorcerer, and that witchcraft was used to impede the struggle for liberation. Two ANC supporters were granted amnesty (AC/2001/073).",
        "An ANC member who was detained and severely beaten by members of the SAP at Sebokeng police station, Transvaal, in 1992. The community had set up self-defence units to protect themselves against the IFP and the SAP, who they perceived as colluding with the IFP.",
        "A COSAS member who was detained by members of the SAP in September 1986. He was held for six months at the Vereeniging police station in the Transvaal, interrogated and severely beaten. Mlungisi was detained again in 1992.",
        "Was shot dead in Kanana, Orkney, Transvaal, on 20 November 1990 by a named perpetrator.",
        "Was shot dead in Kanana, Orkney, Transvaal, on 20 November 1990 by a named perpetrator. ",
        "An MK member from Mdantsane, Ciskei who was shot dead by ANC security while undergoing military training in Angola in 1983. The Commission was unable to find out the exact circumstances that led to his being shot dead.",
        "A UDF supporter who was detained in Prieska, Cape, and severely tortured at the police station by named and other members of the SAP, on 19 May 1986. He was released from custody in December 1986.",
        "A UDF supporter who was tortured by named members of the Municipal Police and the Cradock Security Police members while in custody at the BAAB municipal o ffices in Bedford, Cape, on 13 June 1986. He was charged and convicted with the attempted ‘necklacing’ of the girlfriends of Municipal Policemen and when the sentence was suspended, was detained under the emergency regulations. ",
        "An informer who was shot dead by Vlakplaas operatives near Nelspruit during November 1991, allegedly because it was feared that he would disclose sensitive information about covert operations of the Soweto Security Branch. Mr Bambo, a Mozambican citizen, and several others had been apprehended by the SAP in the early 1980s as they crossed illegally into South Africa, and had been induced to work first for Koevoet and later for the Soweto Security Branch. Three Vlakplaas operatives were granted amnesty (AC/2001/252).",
        "A private security guard who was shot and killed by four APLA operatives during an attack on police members at the Khayelitsha train station, Cape Town, in 1992. Four other private security guards were injured in the attack. Two APLA members were granted amnesty (AC/1998/0103). See APLA attacks.",
        "Was severely assaulted at his home and at the police station in Mahwelereng, Potgietersrus, Lebowa, on 19 April 1986, allegedly by members of the SAP. Mr Bambo was president of the Magongwa Youth League and was suspected of organising students in Mahwelereng.",
        "Was shot and paralysed by members of the SAP who opened fire on mourners at a funeral in Alexandra, Johannesburg, on 15 February 1986.",
        "Was arrested, deprived of food and repeatedly beaten with rifle-butts by Bophuthatswana Police members in Tsineng police station in Kuruman, Cape, on 26 December 1991, allegedly because he was suspected of assaulting a police officer.",
        "An ANC supporter who was severely assaulted by IFP supporters near Stanger, Natal, in September 1993. He was the brother of Wonder-boy Simphiwe Mpo Banda.",
        "An ANC member who had her house in Bhambayi, near KwaMashu, Durban, burnt down on 11 June 1993 by IFP supporters, allegedly supported by members of the ISU, during fighting between the ‘Red’ and ‘Green’ factions.",
        "An ANC supporter and self-defence unit member who was shot dead by members of the SAP while providing security for ANC officials Joe Slovo and Cyril Ramaphosa during their visit to Katlehong, Transvaal, on 9 January 1994.",
        "A UDF leader who was detained on 27 June 1986 by members of the Security Police and held without trial for ten months at St Alban ’s prison, Port Elizabeth. While in detention, he was kept in solitary confinement. On his release in 1987 he was attacked by AmaAfrika supporters in KwaNobuhle, Uitenhage, Cape, suffering severe and permanent psychological damage as a result.",
        "A COSAS member who was detained and tortured at Lenyenye police station in Tzaneen, Transvaal, in April 1985. He was given electric shocks, chained to a chair and assaulted.",
        "An IFP supporter who had his house burnt down by other IFP supporters in Bhomela, Port Shepstone, Natal, on 12 December 1991, because they felt he was not being active enough on behalf of the IFP.",
        "Was severely assaulted with a sjambok by named and other members of the Imbokodo vigilante group, at her home in Vlaklaagte, KwaNdebele, in 1986. Three other people were injured in the attack, which occurred during conflict between local residents and Imbokodo members over the incorporation of Moutse into KwaNdebele.",
        "Was shot dead in Matsulu, KaNgwane, on 14 June 1986, when members of the SAP opened fire on mourners returning from a funeral of a person allegedly shot by the police.",
        "Was tortured by members of the Bophuthatswana Police at Bedwang police station in Moretele 1, Bophuthatswana, in 1992. Mr Banda was accused of attempting to overthrow Chief Nawa, part of the Mangope regime, because he advocated development in his village.",
        "An ANC supporter who was shot and injured by IFP supporters near Stanger, Natal, on 9 December 1993.",
        "Her house was burnt down by IFP supporters in Bhambayi, near KwaMashu, Durban on 19 February 1993 at a time of competition between ANC and IFP supporters for resources and political dominance in the area. About 35 houses were reportedly burnt down in Bhambayi in February 1993.",
        "Her home in Kwelerha, near East London, was stoned and set alight by UDF supporters on 27 March 1986, because she was associated with the Kwelerha tribal authority which supported forced removals. Her three children were injured in the attack, but managed to escape. Another person who was with them was thrown into the burning house and was killed. ",
        "Was shot and wounded when ANC security guards opened fire from the ANC headquarters at Shell House, Johannesburg, on a crowd of IFP marchers, on 28 March 1994. At least nine marchers were killed and around 100 injured. Ten ANC security guards were granted amnesty (AC/2000/142).",
        "His home in Kwelerha, near East London, was stoned and set alight by UDF supporters on 27 March 1986, because he was on a committee connected with the Kwelerha tribal authority which supported forced removals. Committee members were viewed as collaborators.",
        "His home in Kwelerha, near East London, was stoned and set alight by UDF supporters on 27 March 1986, allegedly because his family was associated with the Kwelerha tribal authority which supported forced removals.",
        "Her house was destroyed in an arson attack by supporters of the Lingelethu West Town Council, allegedly aided by SAP members in Khayelitsha, Cape Town, on 20 February 1992.",
        "An ANC supporter who was shot and injured by named members of the SAP at New Brighton police station in Somerset East, Cape, on 30 March 1991 during protests against the Black Local Authority.",
        "A UDF supporter who was severely beaten with sjamboks by members of the Ciskei Police in Berlin, Cape, on 21 September 1985 during a community meeting to protest against the homeland system and to formulate demands to present to Ciskei's then-President Lennox Sebe.",
        "She had her home destroyed in an arson attack at Bhambayi, near KwaMashu, Durban, during 1993, in intense political conflict between the ‘Red’ and ‘Green’ factions",
        "Was shot and injured by a named perpetrator during political conflict at Ugie, Cape, on 6 February 1990.",
        "Was tortured by members of the Security Police at Burgersdorp, Cape, on 18 June 1976, while being interrogated about BPC activities. He was again detained and tortured in 1985 and in 1990.",
        "An ANC supporter who was tear-gassed and trampled on by people attempting to escape shooting by members of the SAP at a mass meeting in Mzamomhle, Burgersdorp, Cape, in August 1985.",
        "She died in North End Prison, Port Elizabeth, on 29 July 1987, allegedly as a result of being denied access to diabetic medication by a named prison warder. She had been detained and tortured for her activities as a street committee member in her area. Despite her deteriorating health, she was kept in solitary confinement during her last days.",
        "His house was burnt down by supporters of Chief BK Matlala in GaMatlala, Lebowa, on 2 February 1980, because he resisted the proposed independence of Lebowa.",
        "Was severely beaten with batons by members of the Bophutha-tswana Police, in Taung, Bophuthatswana, while attending a mass meeting in September 1988.",
        "Was beaten to death by members of the SAP and the security forces in KwaNobuhle, Uitenhage, Cape, on 17 December 1984, while attending a vigil for the family member of a UDF leader who had died in an arson attack.",
        "A COSAS and Alexandra Youth Congress member who was tortured while in detention in Johannesburg Prison, in 1986. Ms Bapela was detained at Sun City Prison under emergency regulations during 1985 and was only released in 1988. Ms Bapela and other activists launched a protest demanding to be charged or released.",
        "An ANC member from Alexandra, Johannesburg, who was detained in Johannesburg by members of the SAP on 1 January 1982. Along with several others, he was charged with sedition. After a long trial, he was acquitted. On 31 December 1988 the house where he was staying was petrol-bombed.",
        "Was doused with petrol and set alight by residents of Marishane village, in Nebo, Lebowa, on 20 August 1992. One ANC member, who claimed Ms Bapela was suspected of witchcraft, was refused amnesty for the incident (AC/2000/112).",
        "A passing motorist who was shot, killed and robbed of his vehicle by MK operatives in Krugersdorp, Transvaal, on 27 September 1991. The MK operatives were escaping arrest after being stopped at a roadblock by traffic officers. Several traffic officers were injured. Three MK operatives were granted amnesty for the incident (AC/1998/0091).",
        "Was injured when MK operatives detonated a limpet mine in a dustbin at the Vanderbijl Square bus terminus, Johannesburg, on 21 September 1988. Nineteen people were injured and a number of vehicles and buildings were damaged. Two MK Special Operations operatives were granted amnesty (AC/2000/056). A late application by a third operative was dismissed.",
        "A member of the BMW who was detained for seventeen days in October 1987 in Pollsmoor prison, Cape Town. During his detention he was interrogated, severely beaten and sexually assaulted by members of a special police Unrest Investigation Unit.",
        "Was seriously injured in Paarl, Cape, on 28 July 1980 when police fired teargas and rubber bullets at the protesters. In the chaos that followed, Charoldine, who was watching the protest, was knocked off a wall and trampled on, resulting in a broken hip.",
        "Was present when a limpet mine, planted by MK operatives, exploded during lunchtime at the Wimpy restaurant in Benoni, Tvl, on 30 July 1988. One woman was killed and at least 66 people were injured. Four MK operatives were granted amnesty for the planning and execution of the attack (AC/1999/0294).",
        "Was shot dead by Basotho paramilitary force members at Qacha’s Nek, Lesotho, close to the Lesotho- Transkei border, in March 1985. He was from East London. Five other APLA members died in this incident, which occurred at a time of increased LLA activity in the area, aimed at destabilising the pro-ANC government of Chief Leabua Jonathan. The Basotho security forces claimed they had mistaken the APLA unit for LLA members. APLA and the LLA were closely connected at the time. ",
        "He suffered serious injuries and was partially blinded when MK operatives detonated an explosive in a car outside the South African Air Force (SAAF) headquarters in Church Street, Pretoria, on 20 May 1983. Twenty one people were killed and two hundred and seventeen injured. The overall commander of MK’s Special Operations Unit and two MK operatives were granted amnesty (AC/2001/003 and AC/2001/023). See Church Street Bombing, Pretoria.",
        "Was injured when members of MK’s Special Operations Unit detonated an explosive in a car outside the SADF Witwatersrand Command headquarters in Johannesburg, on 30 July 1987. At least sixty eight people were injured. Three MK operatives and one UDF supporter, linked to MK, were granted amnesty for their various roles in this attack (AC/2001/0003 and AC/2000/248). See Church Street Bombing, Pretoria.",
        "A sergeant in the SADF who was injured when MK operatives detonated an explosive in a car outside the South African Air Force (SAAF) head-quarters in Church Street, Pretoria, on 20 May 1983. Twenty one people were killed and two hundred and seventeen injured. The overall commander of MK’s Special Operations Unit and two MK operatives were granted amnesty (AC/2001/003 and AC/2001/023). See Church Street Bombing, Pretoria.",
        "Was seriously injured in a limpet mine attack by APLA members at the Buffalo Springs Spur restaurant in Queenstown, Cape, on 3 December 1992. See APLA attacks.",
        "Was shot and injured by named members of the SAP in Bellville, Cape Town, on 29 August 1985. The policemen hid in a garden and then leapt out, shooting indiscriminately at both protesters and bystanders. One person was killed and two seriously injured in the shooting.",
        "A UDF supporter and member of the BMW, was detained for three weeks in Pollsmoor prison, Cape Town. While under interrogation, he was beaten by a named member of a special police Unrest Investigation Unit. Numerous public violence charges against the perpetrator were later withdrawn.",
        "A NUSAS official, was harassed and had his jaw broken when he tried to prevent Witwatersrand Security Branch operatives from disrupting a political gathering in 1985. One Security Branch operative was granted amnesty (AC/2001/0184).",
        "He lost an eye, three fingers and sustained severe burns in a limpet mine explosion outside the Bonteheuwel rent office, Cape Town, on 28 September 1988, when he picked up a milk carton containing a mine, positioned there by members of MK’s Ashley Kriel Detachment. Three MK operatives were granted amnesty (AC/2001/048).",
        "Was injured and permanently disabled after a bomb exploded near a taxi rank in Pretoria on 11 August 1990. Onlookers assaulted him with bottles and fruit in the mistaken belief that he had planted the bomb.",
        "Was arrested with ten other friends in Carnarvon, Cape, on 16 June 1986, for wearing black ties commemorating those who died in the Soweto uprising. He was repeatedly beaten by named members of the SAP at the police station and detained for 72 days under emergency regulations at Carnarvon and then at Victor Verster prison, Paarl, Cape. See police brutality.",
        "Was severely beaten, allegedly by SADF members, at an army base in Tokoza, Transvaal, on 21 September 1992. Mr Basa was reportedly detained after members of the SADF searched his car but failed to find weapons.",
        "An ANC supporter who was stabbed to death by named IFP supporters, in Ndaleni, Richmond, Natal, on 23 June 1991. Two others were killed in the attack. The perpetrators were found guilty in a court of law.",
        "An ANC supporter who had his home near Richmond, Natal, burnt down by IFP supporters on 12 April 1994 in political conflict during the run-up to the April 1994 elections.",
        "An ANC supporter who had her home at Gengeshe, Richmond, Natal, burnt down by IFP supporters on 4 April 1992.",
        "Was disabled in September 1979 after being beaten by members of the SAP during his detention at Hillbrow police station, Johannesburg. Mr Bashe was detained for three months.",
        "Was shot dead by members of the Ciskei Police at a night vigil for a fellow student in Mdantsane, Ciskei, in September, 1985. Two others were killed in the attack.",
        "An ANC supporter who was killed when IFP supporters and Caprivi trainees carried out attacks on ANC supporters in Richmond, Natal, between 21 and 23 June 1991. One perpetrator was granted amnesty (AC/1999/217). See Richmond attacks.",
        "An ANC supporter who was shot dead in Umlazi, Durban, on 7 September 1992, when a crowd of IFP supporters from Unit 17 attacked residents in the adjacent Uganda settlement.",
        "An IFP supporter who was shot dead by other IFP supporters on 16 November 1990 at Wembezi, KwaZulu, near Estcourt, Natal, because he was thought to be an informer for the ANC.",
        "An ANC supporter who was shot in the leg by members of the Bophuthatswana Police in front of his house in Vergenoeg, Upington, Cape, on 27 May 1993. Mr Basi had just returned from an ANC meeting.",
        "An IFP supporter who disappeared from Gengeshe, Richmond, Natal, during ongoing conflict between ANC and IFP supporters in April 1992.",
        "Was shot dead in ongoing conflict between IFP and ANC supporters at Ndaleni, Richmond, Natal, on 30 September 1991. His home was burnt down during the incident.",
        "An ANC supporter who died after being shot and stabbed by IFP supporters near Richmond, Natal, on 9 September 1992.",
        "A SAAWU member who suffered severe ill-treatment while he was detained under emergency regulations in Fort Glamorgan prison, East London, in June 1986, allegedly because of his involvement in political protests. See police brutality.",
        "Was shot and injured by a named SAP member in Kakamas, Cape, on 13 February 1988. The perpetrator opened fire on residents outside a house being raided by police. Two children were shot dead and 13 people injured.",
        "Was arrested in Ashton, Cape, on 17 June 1986, and severely beaten with a sjambok by named members of the SAP while being interrogated in Worcester police station, Cape. He was then detained for three months under emergency regulations. See police brutality.",
        "Was killed and her body mutilated by ANC supporters in Kutloanong, Odendaalsrus, Orange Free State, on 29 September 1990. Four ANC supporters were refused amnesty for the attack (AC/97/0007 and AC/97/0027). See Kutloanong mob attack. ",
        "An ANC supporter who had her house burnt down by IFP supporters in Ixopo, Natal, in June 1993.",
        "Was killed when members of the CDF threw an explosive device into his house at Tyutyu, Bisho, Ciskei, on 19 October 1992. The target of this attack was reportedly Mr Bata’s brother, an ANC supporter, who was not in the house at the time.",
        "Was shot and injured in a drive-by shooting while waiting for a bus in Tembisa, Transvaal, in 1993. Three people died and several others were injured in the attack during violence between IFP and ANC supporters in the area.",
        "An ANC supporter who had his home destroyed in an attack by PAC supporters during political conflict in Lady Frere, Transkei, on 24 March 1994.",
        "An ANC supporter who was detained and severely beaten by members of the SAP in Philipstown, Cape, on 16 December 1985. He had been detained allegedly because he was wearing a political T-shirt.",
        "Was shot dead by members of the SAP in Langa, Uitenhage, Cape, on 21 March 1985 when police opened fire on mourners marching to a funeral. At least 20 people were killed and many injured in the shooting. See Langa shootings.",
        "Had to flee with her family after a crowd threw a petrol bomb through a window of her home at Queenstown, Cape, during a consumer boycott in 1985. Her son had been accused of being a collaborator.",
        "Was shot and severely injured by named members of the SAP at Queenstown, Cape, on 19 November 1985, while handing himself over to police. Two days earlier, police and residents had clashed at a meeting at the Nonzwakazi Methodist Church. Police opened fire, killing at least 11 people and injuring many more. On 27 November, Mr Batyi was arrested while in hospital and charged with public violence. See Queenstown shootings.",
        "He died after he was ‘necklaced’ during a consumer boycott in Queenstown, Cape, in 1986. The named perpetrators had allegedly accused a member of his family of being a collaborator.",
        "Was injured when MK operatives detonated an explosive in a car outside the South African Air Force (SAAF) headquarters in Church Street, Pretoria, on 20 May 1983. Twenty one people were killed and two hundred and seventeen injured. The overall commander of MK’s Special Operations Unit and two MK operatives were granted amnesty (AC/2001/003 and AC/2001/023). See Church Street Bombing, Pretoria. ",
        "Was severely beaten by members of the Ciskei Police near Egerton railway station, Mdantsane, Ciskei, in August 1983, during the Mdantsane bus boycott.",
        "Was shot and injured by SAP members near Crossroads, Cape Town, in February 1987.",
        "A local farmer who was shot dead by an MK operative near Mount Ayliff, Transkei, on 3 November 1993. The MK operative was granted amnesty for the incident (AC/2000/002).",
        "Lost his left eye when he was shot by members of the SAP on 19 October 1993 in Diepkloof, Soweto, Johannesburg. He had been locked outside the school gate with other latecomers and had started stoning an approaching furniture truck.",
        "He sustained minor injuries when MK operatives detonated a car bomb using a remote control device outside the Ellis Park rugby stadium, Johannesburg, on 2 July 1988. Two spectators leaving the rugby match were killed and thirty seven others sustained minor and major injuries. Four operatives from MK’s Special Operations Unit, including its commander, were granted amnesty (AC/2001/161).",
        "An ANC supporter who had her home at Umlazi, Durban, set alight by IFP supporters in December 1991.",
        "An ANC supporter who had her home at Umlazi, Durban, set alight by IFP supporters in December 1991.",
        "Was severely injured when a bomb, planted by members of the AVF, exploded in Wesselsbron, Orange Free State, on 15 November 1993, during a right-wing campaign to force the government to acknowledge their struggle for the creation of a volkstaat. Four perpetrators were granted amnesty (AC/1999/0001)",
        "A member of the Stutterheim Youth Congress who was detained and tortured by named members of the SAP during a consumer boycott in King William ’s Town, Cape, on 27 December 1985. He was charged with murder, but the case against him was withdrawn.",
        "Was shot and injured by men wearing balaclavas in Khayelitsha, Cape Town, in November 1991, reportedly during conflict between ANC supporters and local councillors. Several others were also injured in the attack. See balaclava groups.",
        "Was shot dead by a named IFP supporter on 24 April 1993 at KwaQanyaza, near Port Shepstone, Natal, because he was thought to be an ANC supporter and was working in an IFP area. His family home was destroyed in the attack.",
        "She lost her home and property in an attack by named IFP supporters at KwaQanyaza, near Port Shepstone, Natal, on 24 April 1993. Ms Bazley’s son, who was thought to be an ANC supporter, was shot dead in the attack.",
        "A civilian who was killed and then robbed of his firearm by members of APLA in an ambush of his vehicle at New Brighton, Port Elizabeth, during March 1991. One APLA member was granted amnesty (AC/1999/0309). See APLA attacks.",
        "Was severely injured in an arson attack by supporters of Chief Tshjawa in Maboloko, Bophuthatswana, during political conflict between supporters of Chief Tshjawa and his rival Chief Lion in 1976.",
        "A UDF supporter who was shot by a member of the Security Branch during the consumer boycott in KwaZakele, Port Elizabeth, in May 1986. As a result of the shooting, she is paralysed.",
        "A member of the Municipal Police who was shot by UDF supporters in Soweto, Johannesburg, on 22 April 1988 while executing warrants for rent defaulters.",
        "Was severely beaten and kicked by 12 members of the SAP who made racist comments while arresting him in Johannesburg for alleged reckless driving on 16 May 1993.",
        "A UDF activist who was detained, interrogated and severely tortured by named members of the SAP at Willowmore police station, Cape, in June 1986.",
        "A UDF activist who was detained, interrogated and severely tortured by named members of the SAP at Willowmore police station, Cape, in June 1986.",
        "A sergeant in the ISU who suffered injuries when he and 12 other policemen were attacked by self-defence unit (SDU) members whilst on foot patrol in Khayelitsha, Cape Town, on 22 July 1992. Six policemen were injured in the exchange of fire. Two SDU members applied for and were granted amnesty for the incident (AC/1997/0029).",
        "A member of the SAP who suffered an attempt on his life when he and his colleagues attempted to stop a vehicle occupied by an MK unit in Nyanga, Cape Town, on 7 July 1990. An MK operative in the vehicle opened fire, killing one policeman. One MK operative was granted amnesty for the incident (AC/1999/0331).",
        "Was stoned and stabbed to death by a crowd of protesters on 11 August 1980 while driving near Crossroads, Cape Town. A second motorist was also attacked and killed that afternoon, during protests related to a bus boycott. Six people were convicted of the killings and sentenced to lengthy prison sentences. One of those convicted, an ANC supporter, was granted amnesty for the killing (AC/99/0298).",
        "Had his home destroyed in an arson attack by UDF supporters at Kwa-Nobuhle, Uitenhage, Cape, in February 1986. The crowd was reportedly searching for his son, a PAC supporter, whom they believed had killed a UDF supporter.",
        "Had his home and business destroyed in arson attacks by UDF supporters in KwaNobuhle, Uitenhage, Cape, in February 1986. The perpetrators accused him of killing a UDF supporter. In 1990 he again lost his home in an arson attack in Langa, Uitenhage, Cape, allegedly because of his leadership role in conflict between the UDF and AmaAfrika supporters.",
        "A PAC supporter who was shot dead by UDF supporters during political conflict in Uitenhage, Cape, on 17 November 1987.",
        "A COSAS member who was severely beaten after his arrest by named SAP members in Upington, Cape, on 13 November 1985. He was again arrested and beaten in December. One of the Upington 26, Mr Bekebeke, spent long periods in custody while on trial before receiving a suspended sentence.",
        "A youth activist who was severely beaten by named SAP members for several days after his arrest on 20 November 1985, after which he was charged, with 25 others, for the crowd killing of a member of the Municipal Police. One of the Upington 26, Mr Bekebeke was sentenced to death with 13 others and spent two years on death row until his sentence was commuted to a prison term. He was released as a political prisoner in 1992. He were granted amnesty for the killing of Sethwale, the municipal policeman.",
        "Was abducted, along with six other youths, by UDF supporters in Grahamstown, Cape, on 31 October 1986. The youths were all severely assaulted and tortured. One was shot and killed. One UDF supporter was granted amnesty (AC/1999/0247).",
        "Was hacked to death by two named Inkatha supporters at Molweni, KwaZulu, near Durban, on 19 July 1988, in intensifying political conflict in the area.",
        "A UDF supporter from East London who died in the aftermath of student protest at the University of Zululand at Ongoye, KwaZulu, near Empangeni, Natal, on 30 October 1983. Five hundred armed Inkatha supporters and students clashed with other protesting students after Chief MG Buthelezi, then Chancellor, tried to organise a commemoration ceremony in honour of King Cetshewayo.",
        "An ANC supporter who was detained and tortured in Westville Prison, near Durban, in 1985. The Bekwa family suffered continuous police harassment after one member of the family went into exile in 1974.",
        "An ANC supporter who was subjected to continuous police harassment in KwaMashu, Durban, from 1974, after her brother went into exile.",
        "An ANC supporter who was repeatedly intimidated and harassed at KwaMashu, Durban, in 1990 by other ANC supporters who suspected him of ‘spying’ for the police.",
        "An MK operative who was shot and injured by SADF Special Forces operatives on 9 December 1982 in Maseru, Lesotho. Thirty South Africans and twelve citizens of Lesotho were killed in the midnight attack on several ANC houses and a block of flats.",
        "He lost a leg after being shot by members of the SAP in Jouberton, Klerksdorp, Transvaal, on 5 March 1986. Six months later, Mr Belaweni was charged with public violence and sentenced to two years’ imprisonment.",
        "Was harassed by members of the SAP at Bizana, Transkei, in March 1960, after they had arrested her husband, whom they accused of leading the Pondoland revolt.",
        "An ANC supporter who was tortured in police cells in Mount Fletcher, Transkei, in March 1960, while being interrogated about Nonqulwana meetings during the Pondoland revolt.",
        "An ANC supporter who was detained at Bizana, Transkei, in June 1960, during the Pondoland revolt.",
        "Disappeared from his home in Bizana, Transkei, in 1960, during the Pondoland revolt.",
        "Was attacked, beaten with spiked sjamboks and thrown from a moving train by IFP supporters between Phomolong and Mzimphlophe stations in Soweto, Johannesburg, in June 1991. See train violence.",
        "Was stabbed and burnt to death by ANC supporters in Kutloanong, Odendaalsrus, Orange Free State (OFS) on 29 September 1990. Four ANC supporters were refused amnesty for the attack (AC/97/0007 and AC/97/0027). See Kutloanong mob attack.",
        "A UDF supporter who died after being run over by an armoured police vehicle in Khayelitsha, Uitenhage, Cape, on 28 December 1989. Mr Belesi was fleeing from police during conflict with AmaAfrika supporters when he was hit.",
        "Was shot and injured when APLA members carried out an attack on the Highgate Hotel, East London, on 1 May 1993. Five people were killed and several others injured. See APLA attacks.",
        "Was severely beaten by the sons of the local chief at Dulcie’s Neck, Transkei, on 1 October 1964, when his family was forced off their land by the traditional leaders of the area",
        "An employee at Nedbank in Caledon Street, Uitenhage, Cape, suffered severe trauma when she was taken hostage and used as a human shield by APLA operatives during a foiled bank robbery on 4 January 1994. Two perpetrators were granted amnesty for the armed robbery and kidnapping (AC/2000/125). See APLA attacks.",
        "An ANC supporter who was shot dead when police opened fire on a student protest march in Viljoenskroon, Orange Free State, on 19 April 1990. Four other ANC supporters were killed and seven injured in the shooting.",
        "An ANC supporter who was shot and severely injured by members of the SAP at a protest meeting against rent increases in Siyathuthuka, Belfast, Transvaal, on 4 January 1986.",
        "Was severely beaten by members of the SAP at Sterkspruit, Transkei, on 1 January 1990 during a consumer boycott and campaign of opposition to the chiefs.",
        "Was killed when two MK operatives detonated a bomb in a shopping centre on 23 December 1985, in Amanzimtoti, near Durban, in retaliation for a South African security forces attack two weeks earlier on ANC members in Lesotho in which nine people had been killed. The explosion in Amanzimtoti killed five people and injured 61. One of the operatives was sentenced to death and later hanged.",
        "Was injured in a hand grenade explosion on 25 May 1993 in Kimberley, Cape, during an ANC protest march to the Bophuthatswana consulate. Two MK operatives threw a hand grenade at the building which bounced back into the crowd, killing one person and injuring 41 others. Two ANC members were wrongly convicted of the killing. Four MK operatives and ANC members, two of whom denied guilt, were refused amnesty (AC/2000/053 and AC/2000/241).",
        "A UDF supporter who was attacked with a pickaxe by vigilantes outside his home in Nyanga, Cape Town, on 31 December 1985. He suffered severe head injuries. His wife and son were also beaten in the attack.",
        "A CAYCO member who was severely beaten by vigilantes near Nyanga, Cape Town, on 31 December 1985. His mother and father were also beaten in the attack.",
        "A UWO member who was severely beaten by vigilantes at her home in Nyanga, Cape Town, on 31 December 1985. Her husband and son were also injured in the attack.",
        "An ANC branch chairman who was stabbed to death, and his wife seriously injured, by named IFP supporters at KwaMakhutha, Amanzimtoti, near Durban, on 20 July 1991. Mr Bengu was a member of a Peace Committee facilitating negotiations between the ANC and IFP at the time.",
        "An ANC supporter who had her home destroyed in an arson attack by Inkatha supporters at Imbali, Pietermaritzburg, on 11 February 1990, in political conflict in the area following the release of Nelson Mandela from prison.",
        "He disappeared on his way to work in Vosloorus, Transvaal, during a stayaway to protest against IFP violence on 28 March 1994. Mr Bengu was never seen again. Mr Bengu’s car was later found in Natal and three suspects were charged with murder, vehicle theft and kidnapping but were acquitted due to lack of evidence.",
        "A UDF supporter who was stabbed to death by Inkatha supporters in KwaMakhutha, Amanzimtoti, near Durban, on 25 December 1987.",
        "Had her home burnt down at Nyanini, KwaZulu, near Eshowe, Natal, in 1994 in political conflict between ANC and IFP supporters during the run-up to the April 1994 elections.",
        "An ANC supporter who was assaulted by named Inkatha supporters at KwaMakhutha, Amanzimtoti, near Durban, in 1987. Her husband and son were stabbed to death in separate incidents of political violence in the area.",
        "A UDF supporter who was tortured by members of the Special Branch during his detention at Pietermaritzburg in 1986. He was also kept in solitary confinement for three months.",
        "An ANC supporter who had her home burnt down at Magabheni, Umgababa, KwaZulu, near Durban, in September 1991 in continuing political conflict between IFP and ANC supporters in the area.",
        "Died after being shot and stabbed with spears on 6 September 1990 in Soweto, Johannesburg, during clashes between hostel-dwellers and residents. Several other people were injured during this attack.",
        " A UDF supporter who was shot and injured by a named member of the SAP in Zwelethemba, Worcester, Cape, on 21 September 1985, after a crowd had petrol bombed the policeman’s house.",
        "Was beaten and stabbed to death by AWB members in East London on 12 March 1994. See right-wing attacks.",
        "Was shot dead at the Manganese Metal Company in Randfontein, Transvaal, on 6 May 1991, during political conflict between the IFP and the ANC in Kagiso, Transvaal.",
        "Was shot and injured by members of the AWB on 12 December 1993 at an illegal roadblock set up outside Ventersdorp, Transvaal. Four people, including two children, were killed in the attack. One AWB member was granted amnesty; eight other applications were refused (AC/1999/0045). See Rodora roadblock killings.",
        "A banned lawyer and exile who was subjected to constant surveillance and harassment by the Witwatersrand Security Branch during 1981 when he returned to South Africa from Swaziland for medical treatment. A Security Branch operative was granted amnesty (AC/2001/230).",
        "A UDF activist who was shot and beaten by members of the SAP on 2 May 1985, and kept in hospital under police guard at Kwa-Nobuhle, Uitenhage, Cape.",
        "Was dismissed from work in Uitenhage, Cape, on 25 April 1985, after testifying before the Kannemeyer Commission of Enquiry into the Langa shootings that had taken place on 21 March 1985. Mr Berry, who was an ambulance driver, gave evidence about how police prevented him from helping the wounded at the scene of the shootings.",
        "An ANC supporter who was one of two people burnt to death when attackers, aligned to a local Crossroads leader, set fire to the house in which she was sleeping in Crossroads, Cape Town, on 7 February 1990. There was conflict in Crossroads between those who wished to join the ANC and the named local leader who opposed this.",
        "Was shot dead by members of the SAP at Sharpeville, Vereeniging, Transvaal, on 21 March 1960. See Sharpeville Massacre.",
        "A UDF supporter who was shot dead in a shoot-out with members of the SAP in Veeplaas, near Port Elizabeth, on 26 May 1987.",
        "Was injured when MK operatives detonated an explosive in a car outside the South African Air Force (SAAF) headquarters in Church Street, Pretoria, on 20 May 1983. Twenty one people were killed and two hundred and seventeen injured. The overall commander of MK’s Special Operations Unit and two MK operatives were granted amnesty (AC/2001/003 and AC/2001/023). See Church Street Bombing, Pretoria.",
        "A UDF supporter who was detained on charges of arson in Graaff-Reinet, Cape, in 1986.",
        "Was beaten to death with iron bars by members of the UDF-supporting AmaButho on a soccer field at Fingo Village, Grahamstown, Cape, on 6 March 1983. Bete's brother was a member of the SAP. See AmaButho. ",
        "He survived a shooting by members of the UDF-supporting Amabutho in Grahamstown, Cape, on 31 December 1985. Mr Bete’s car was burnt in the attack. His brother was a member of the SAP.",
        "Was injured in a hand grenade explosion on 25 May 1993 in Kimberley, Cape, during an ANC protest march to the Bophuthatswana consulate. Two MK operatives threw a handgrenade at the building which bounced back into the crowd, killing one person and injuring 41 others. Two ANC members were wrongly convicted of the killing. Four MK operatives and ANC members, two of whom denied guilt, were refused amnesty (AC/2000/053 and AC/2000/241).",
        "A Duncan Village street committee member who was poisoned while in detention in Fort Glamorgan prison, East London, in June 1986.",
        "Was shot dead by members of the SADF during intense public unrest in Duncan Village, East London, on 13 August 1985.",
        "A UDF supporter who was arrested in June 1986 and detained for three months under emergency regulations in George, Cape.",
        "An SACP supporter who was shot and injured by Ciskei Police during protests in Dimbaza, Ciskei, on 3 September 1985.",
        "An ANC supporter who was shot dead by members of the SAP who opened fire on a meeting of the local Hill Committee at Flagstaff, Transkei, in November 1960. Four others were injured in the incident. See Pondoland revolt.",
        "Was shot dead by members of the Riot Squad in Mossel Bay, Cape, on 10 September 1976, when police opened fire on protesting residents during the Soweto uprising.",
        "A member of the ANC and the Hill Committee of Bizana who was tortured in detention and lost his home in 1960 during the Pondoland revolt. See Pondoland revolt. ",
        "An ANC supporter who was shot and killed by unidentified persons in an attack on his home in  Lamontville, Durban on 30 November 1990 during intensifying political conflict between ANC and IFP supporters in the area. Mr Bhambula’s wife, also an ANC supporter, was shot and injured in the attack.",
        "An ANC supporter who was shot and injured in an attack by unidentified persons on her home in Lamontville, Durban, on 30 November 1990 during intensifying political conflict between ANC and IFP supporters in the area. Ms Bhambula’s husband, also an ANC support e r, was killed in the attack. ",
        "Was shot in the back by members of the SAP in Uitenhage, Cape, on 21 March 1985 when police opened fire on mourners toyi-toying on their way to a funeral.",
        "He had his home in Bhambayi, near KwaMashu, Durban, burnt down in 1993 at a time of competititon for re s o u rces and political dominance between the ‘Red’ and ‘Green’ factions  in the area. More than three hundred people died violently in Bhambayi in 1993. Hundreds of homes were burnt down.",
        "He had his home destroyed in an arson attack by UDF supporters in KwaNobuhle, Uitenhage, Cape, in 1986. In February 1990 he again lost his home in an arson attack in KwaNobuhle during conflict between the UDF and AmaAfrika supporters. See AmaAfrika. ",
        "A UDF supporter who suffered trauma when a group of Inkatha supporters and Caprivi trainees attacked a UDF meeting in a house at Mpumalanga, KwaZulu, near Durban, on 18 January 1988. Nine people were killed and an estimated 200 people were injured in the attack. The group went on to destroy around eight houses. One former Inkatha member was granted amnesty (AC/1999/0332).",
        "A private security guard who was shot and injured by four APLA operatives during an attack on police members at the Khayelitsha train station, Cape Town, in 1992. Four other private security guards were injured in the attack. Two APLA members were granted amnesty (AC/1998/0103). See APLA attacks.",
        "An ANC supporter who was severely beaten by members of the Transkei Police in Bebeza Village, near Sterkspruit, Transkei, on 1 January 1990 during a consumer boycott and campaign of opposition to the chiefs.",
        "Was severely beaten by members of the Transkei Police in Bebeza Village near Sterkspruit, Transkei, on 1 January 1990 during a consumer boycott and campaign of opposition to the chiefs.",
        "An ANC supporter who was severely beaten by members of the Transkei Police in Bebeza Village, near Sterkspruit, Transkei, on 1 January 1990 during a consumer boycott and campaign of opposition to the chiefs.",
        "A UDF supporter who had his house and property destroyed on 6 April 1990 when a group of Inkatha supporters attacked UDF supporters and residents at Mpumalanga, KwaZulu, near Durban, in spite of a heavy police and military presence. Fourteen people were killed and at least 120 homes burnt down. One former IFP member was granted amnesty (AC/1999/0332).",
        "An Inkatha supporter who had her home in Cottonlands, Verulam, Natal, petrol-bombed on 12 January 1990 when UDF supporters attacked mourners at a night vigil for the slain son of a local Inkatha chairman. Thirteen people, including nine children, were killed. Ms Bhengu suffered another incident of arson on 7 December 1991, this time in Emangwaneni, Bulwer, Natal, during an IFP attack in which she was mistakenly taken to be an ANC supporter. See Verulam attacks. ",
        "An ANC supporter who had her home burnt down by Inkatha supporters on 10 February 1990 in KwaNxamalala, KwaZulu, near Pietermaritzburg, in political conflict following the unbanning of political organisations on 2 February. Ms Bhengu was reportedly shot dead two years later in Northdale, Pietermaritzburg.",
        "An ANC supporter who was shot dead by named Inkatha supporters at Inanda, near KwaMashu, Durban, on 13 November 1989.",
        "A UDF supporter who had his house and property destroyed on 6 April 1990 when a group of Inkatha supporters attacked UDF supporters and residents at Mpumalanga, KwaZulu, near Durban, in spite of a heavy police and military presence. Fourteen people were killed and at least 120 homes burnt down. One former IFP member was granted amnesty (AC/1999/0332).",
        "An IFP supporter who was shot and injured and lost his home and shop at Loskop, near Estcourt, Natal, in an attack by ANC supporters on 30 April 1993.",
        "She was killed when named Inkatha supporters petrol bombed her home in KwaMakhutha, Amanzimtoti, near Durban, on 19 January 1990. The attackers suspected the Bhengu family of being sympathetic to the UDF. Ms Bhengu’s son and daughter also died in the attack, and her husband was shot and injured.",
        "Was shot in the leg when named Inkatha supporters attacked his home in KwaMakhutha, Amanzimtoti, near Durban, on 19 January 1990. The attackers suspected the Bhengu family of being sympathetic to the UDF. Mr Bhengu’s son, daughter and wife were all killed in the attack.",
        "Was killed when named Inkatha supporters attacked her home in KwaMakhutha, Amanzimtoti, near Durban, on 19 January 1990. The attackers suspected the Bhengu family of being sympathetic to the UDF. Ms Bhengu’s brother and mother were also killed in the attack. Her father survived the attack with gunshot injuries. ",
        "An ANC supporter who lost her home in an arson attack by IFP supporters at Nhlangakazi, near Stanger, Natal, on 16 January 1994.",
        "Was shot and injured during an arson attack on his home in Ntshongweni, KwaZulu, near Pinetown, Natal, on 26 December 1988 in political conflict between UDF and Inkatha supporters in the area.",
        "An ANC supporter who was shot dead by Inkatha supporters at Mpumalanga, KwaZulu, near Durban, in December 1985.",
        "Was shot and injured by IFP supporters during 1993 in Bhambayi, near KwaMashu, Durban, at a time of competititon for resources and political dominance between the ‘Red’ and ‘Green’ factions. More than three hundred people died violently in Bhambayi in 1993. Hundreds of homes were burnt down.",
        "An ANC supporter who was shot dead by named IFP supporters in Mpophomeni, KwaZulu, near Howick, Natal, on 14 April 1993. Twelve others died in the area in that week in political violence.",
        "Was shot, burnt, and stabbed to death in Hammarsdale, Natal, on 9 August 1989, in political conflict between UDF and Inkatha supporters in the area.",
        "A COSATU shopsteward and local peace negotiator who was shot dead outside his shop in KwaMnyavu, near Pietermaritzburg, on 29 May 1991 by IFP supporters who suspected him of providing information to police on IFP actions in the area.",
        "Had her home in the Emangwaneni area, near Bulwer, Natal, burnt down on 7 December 1991 in continuing political conflict between ANC and IFP supporters in the area. Her sons, who may have been the target of the attack, were believed to be ANC supporters.",
        "An ANC supporter who had her home in Lindelani, near KwaMashu, Durban, burnt down by IFP supporters on 28 May 1993.",
        "A non-partisan community leader who was shot dead by a named ANC supporter in Imbali, Pietermaritzburg, on 6 February 1989 in intensifying conflict between UDF and Inkatha supporters in the area. The ‘com-tsotsi’ were youths perceived to support the UDF, who frequently engaged in criminal acts in pursuit of personal and political aims.",
        "Was shot dead in Hammarsdale, Natal, on 9 August 1989, in political conflict between UDF and Inkatha supporters in the area.",
        "An ANC supporter who disappeared from his home in Umkomaas, Natal, in May 1993, after he had been severely assaulted by unidentified persons who attacked his home during political conflict in the area. He has not been seen since and is presumed dead.",
        "Was killed in a petrol bomb attack on his home by named Inkatha supporters in KwaMakhutha, Amanzimtoti, near Durban, on 19 January 1990. The attackers suspected the Bhengu family of being sympathetic to the UDF. Siphelele’s mother and sister also died in the attack; his father was shot and injured.",
        "A UDF supporter who was shot and injured when a group of Inkatha supporters and Caprivi trainees attacked a UDF meeting in a house at Mpumalanga, KwaZulu, near Durban, on 18 January 1988. Nine people were killed and an estimated 200 people were injured in the attack. The group went on to destroy around eight houses. One former Inkatha member was granted amnesty (AC/1999/0332).",
        "A UDF supporter who was threatened at gunpoint when a group of Inkatha supporters and Caprivi trainees attacked a UDF meeting in a house at Mpumalanga, KwaZulu, near Durban, on 18 January 1988. Nine people were killed and an estimated 200 people were injured in the attack. The group went on to destroy around eight houses. One former Inkatha member was granted amnesty (AC/1999/0332).",
        "Had her home burnt down by Inkatha supporters, allegedly assisted by members of the SAP, at KwaNxamalala, KwaZulu, near Pietermaritzburg, in February 1990, during political conflict in the area.",
        "Was stabbed and necklaced to death by a crowd of ANC supporters in Inanda, near KwaMashu, Durban, on 7 April 1991. She and her husband, who was shot dead in the same incident, were suspected of being IFP supporters. One ANC member was granted amnesty (AC/2000/217).",
        "An ANC supporter who was shot and injured by IFP supporters in Lindelani, near KwaMashu, Durban, on 28 May 1993.",
        "An ANC supporter who was shot dead by IFP supporters in Enseleni, KwaZulu, near Empangeni, Natal, on 17 January 1994 in political conflict during the run-up to the April 1994 elections.",
        "Sustained injuries when Security Branch members detonated an explosive device at the Why Not Club, Vanderbijl Square, Johannesburg, on 21 September 1988. The club was targeted because it was allegedly frequented by ANC supporters. Four members of the Witwatersrand Security Branch, including the divisional commander and his deputy, and one Vlakplaas operative were granted amnesty for the operation (AC/2001/046).",
        "Had his home burnt down by ANC supporters in Richmond Farm, KwaMashu, Durban, on 12 February 1990, in intense political conflict in the area. See Richmond Farm arson attacks.",
        "An ANC supporter who had her home burnt down by Inkatha supporters in Ntuzuma, Durban, in August 1989, in intense political conflict in the area.",
        "An ANC supporter who was shot dead by IFP supporters on 1 January 1992 in Esikhawini, KwaZulu, near Empangeni, Natal, in continuing political conflict in the area.",
        "An iKongo member who was shot by members of the SAP in 1960 in Bizana, Transkei, during the Pondoland revolt.",
        "Bheswa had his home destroyed in an arson attack in Inanda, near KwaMashu, Durban, in 1993, in political conflict between IFP and ANC supporters in the area.",
        "Was severely ill-treated and had his property damaged during the Boipatong massacre in Boipatong, near Vanderbijlpark, Transvaal, on 17 June 1992, which left forty five people dead and twenty seven seriously injured. Thirteen perpetrators were granted amnesty; a further three applications were refused (AC/2000/209).",
        "An MK operative who was abducted, shot in the head and killed on 22 February 1987 by Security Branch operatives. His body was then allegedly thrown off a cliff in a remote area near Umbumbulu, Natal. Mr Bhila had been acquitted of terrorism charges only days earlier. Two Port Natal and three Vlakplaas operatives were granted amnesty for the operation (AC/2001/112).",
        "A student leader who was shot dead by a named SAP member on 21 August 1985 during political conflict between youth and police in Dukathole, Aliwal North, Cape. See Aliwal North shootings.",
        "A COSAS supporter who lost an eye when members of the SAP opened fire to disperse a meeting in February 1990 in Maclear, Cape. The meeting was in support of a COSATU stayaway. Ms Bhoto was then arrested. One other person was shot and injured in the same incident.",
        "Was abducted from his place of business in Siyabuswa, KwaNdebele, by UDF supporters in June 1986 and found burnt to death a few days later. The incident took place during conflict over the independence of KwaNdebele.",
        "Was abducted by ‘comrades’ from his shop at Siyabuswa, KwaNdebele, in June 1986. A few days later, he was found burnt to death. Subsequently his shop was burnt down, one of many destroyed during political conflict over the proposed independence of KwaNdebele.",
        "Was stabbed to death, allegedly by Inkatha supporters in Kempton Park, Transvaal, on 27 January 1990 during political conflict in the area.",
        "Was stabbed to death, allegedly by Inkatha supporters in Kempton Park, Transvaal, on 27 January 1990 during political conflict in the area.",
        "Had his house near Dennilton, KwaNdebele, vandalised by supporters of Chief Mahlangu in July 1975, during political conflict over KwaNdebele independence.",
        "Was abducted from his shop outside Siyabuswa, KwaNdebele, and burnt to death by ‘comrades’ in June 1986. Mr Bhuda’s shop was also burnt. Between May and August 1986, 70% of KwaNdebele’s businesses were destroyed by residents in violent conflict over the incorporation into the homeland.",
        "An ANC supporter who had her house burnt down by IFP supporters on 16 March 1994 at Sonkombo, Ndwedwe, KwaZulu, near Durban, in intense political conflict in the area. See Sonkombo arson attacks.",
        "An ANC supporter who had her house burnt down by IFP supporters on 16 March 1994 at Sonkombo, Ndwedwe, KwaZulu, near Durban, in intense political conflict in the area. See Sonkombo arson attacks.",
        "An ANC supporter who had her house burnt down by IFP supporters on 16 March 1994 at Sonkombo, Ndwedwe, KwaZulu, near Durban, in intense political conflict in the area. See Sonkombo arson attacks.",
        "An ANC supporter who had her home burnt down by IFP supporters on 16 March 1994 at Sonkombo, Ndwedwe, KwaZulu, near Durban. See Sonkombo arson attacks.",
        "Sustained injuries when Security Branch members detonated an explosive device at the Why Not Club, Vanderbijl Square, Johannesburg, on 21 September 1988. The club was targeted because it was allegedly frequented by ANC supporters. Four members of the Witwatersrand Security Branch, including the divisional commander and his deputy, and one Vlakplaas operative were granted amnesty for the operation (AC/2001/046).",
        "An ANC supporter who had her home destroyed in an arson attack by IFP supporters at Inanda, near KwaMashu, Durban, during 1990, in ongoing political conflict in the area.",
        "An ANC supporter who had his house destroyed in an arson attack in Umlazi, Durban, on 17 January 1992, in intense political conflict in the area. See Chimora Settlement attacks.",
        "Was shot dead by named members of the SAP during protests in Old Location, near Hofmeyr, Cape, on 29 October, 1981, while resisting arrest.",
        "A PEWO member who suffered a stroke after members of the SAP fired teargas at a group of mourners at New Brighton, Port Elizabeth, on 20 April 1986. She was partially paralysed and lost her speech as a result.",
        "An MK operative, and three others, who were abducted by Eastern Transvaal Security Branch operatives from the Bhunya police station in Swaziland on 14 April 1984. All four were coerced into becoming askaris at Vlakplaas. Four Eastern Transvaal Security Branch operatives, including the divisional commander, were granted amnesty (AC/2000/105).",
        "He disappeared from his school in King William ’s Town, Cape, in October 1976 and is believed to have died in exile.",
        "An US Fulbright Scholar who was stoned and stabbed to death by a group of PASO supporters in Guguletu, Cape Town, on 25 August 1993, as she was driving friends to their home. The crowd was returning from a PASO meeting addressed by PAC leadership, and was stoning vehicles. Four perpetrators were granted amnesty (AC/1998/0030).",
        "Had his home destroyed in an arson attack by IFP supporters at Ixopo, Natal, in June 1993, in continuing political conflict in the area.",
        "Had his home destroyed in an arson attack by IFP supporters at Ixopo, Natal, in June 1993, in continuing political conflict in the area.",
        "Was shot and injured by members of the SAP at her home in Fingo Village, Grahamstown, Cape, in 1986. One other person was shot and killed in the same incident.",
        "Was shot by Special Constables during political conflict in Grahamstown, Cape, on 2 February 1987.",
        "An ANC supporter who was tortured in detention by named members of the Ciskei Security Police at Mdantsane, Ciskei, on 16 July 1987. He was suspected of harbouring freedom fighters.",
        "A banned senior member of the Black Consciousness Movement who sustained severe brain injuries while being interrogated by members of the Port Elizabeth Security Branch on 6 September 1977. He died of his injuries on 12 September 1977 after being transported in the back of a police vehicle some 1200 km to the Pretoria Central Prison hospital. Five members of the Port Elizabeth Security Branch applied for amnesty for his death, claiming that the injuries had been inflicted accidentally during a violent scuffle. Amnesty was refused (AC/1999/0020).",
        "Was present when a limpet mine, planted by MK operatives, exploded during lunchtime at the Wimpy restaurant in Benoni, Transvaal, on 30 July 1988. One woman was killed and at least 66 people were injured. Four MK operatives were granted amnesty for the planning and execution of the attack (AC/1999/0294).",
        "Had her house burnt down during intensifying conflict between UDF and Inkatha supporters at Phoenix, Durban, in 1989. At the time of the arson attack, she had fled to Chibini Church because of the violence in the area.",
        "Was shot dead by members of the SAP during protests in Cradock, Cape, on 14 August 1987.",
        "An ANC supporter who was shot dead by members of the CDF in Bisho, Ciskei, on 7 September 1992 during an ANC protest march to demand free political activity in Ciskei. Thirty people were killed and 200 people injured in what became known as the Bisho massacre. Two members of the former CDF were refused amnesty for the shooting (AC/2000/122).",
        "Was detained in Soshanguve, Transvaal, in October 1986 and later received a prison sentence for burning a police member’s home.",
        "Suffered severe trauma when APLA operatives, armed with automatic weapons and hand grenades, stormed the Yellowwoods hotel, in Fort Beaufort, Cape, on 23 March 1993, and opened fire on staff and patrons. One person was shot dead in the attack. Three perpetrators were granted amnesty (AC/2000/225). See APLA attacks. ",
        "Was assaulted and detained by members of the Bophuthatswana Police on 19 July 1989 at Mafikeng Police station, Bophuthatswana. He was arrested on suspicion of transporting members of the liberation movement from Botswana.",
        "Was killed by ANCYL members on 22 or 23 November 1991 during political conflict in Krugersdorp, Transvaal. The ANCYL members abducted Mr Binder while he was transporting weapons to IFP-supporting hostel-dwellers in Kagiso to be used in an attack on ANC supporters in nearby Swanieville. One perpetrator was granted amnesty for the incident (AC/1999/0295).",
        "A PAC supporter who was detained and assaulted by SAP members in Sterkstroom police station, Cape, and Kroonstad prison, Orange Free State, in April 1963, because he was allegedly believed to be involved in political activities at school. Mr Bingwa, and other scholars, were charged and sentenced on 26 June 1963. He served his sentence and was released in 1965.",
        "A PAC supporter who was convicted of sabotage during the 1960 protests in Cape Town and sentenced to seven years’ imprisonment on Robben Island, Cape Town.",
        "Was tortured in police custody on 16 June 1985 in Dimbaza, Ciskei.",
        "An ANC supporter who lost three rondavels when they were set alight and bulldozed by members of the Transkei Defence Force at Baziya, near Umtata, Transkei, on 14 December 1980.",
        "An ANC supporter who was injured while escaping from an armed attack on a home in KwaSithole, Murchison, near Port Shepstone, Natal, on 5 April 1993 in continuing political conflict between ANC and IFP supporters in the area. Ten ANC supporters were killed and two injured in the attack.",
        "Was tortured by a named member of the SAP while in detention at Jansenville prison, Cape, during the state of emergency in April 1985. See police brutality.",
        "An MK member who was shot dead by members of the SADF in Thabazimbi, Transvaal, in April 1988.",
        "An IFP supporter who was abducted and shot dead by a named member of the SADF on 14 April 1994 at Mtwalume, near Umzinto, Natal.",
        "Had her home burnt down on 20 April 1992 in Hopewell, Ixopo, Natal, in ongoing political conflict between ANC and IFP supporters in the area.",
        "A UDF supporter who was on his way home from a peace meeting on 27 August 1989 in Imbali, Pietermaritzburg, when he and his companions were attacked by a named Inkatha supporter. Mr Biyase and another UDF supporter were shot dead, while a third UDF supporter was injured.",
        "An ANC supporter who was shot dead in Imbali, Pietermaritzburg, on 1 December 1992 by the same named IFP supporter who had killed his brother in 1989.",
        "Died after being stabbed and shot while attending an IFP rally on 20 February 1994 at Enseleni, KwaZulu, near Empangeni, Natal.",
        "Was shot dead by IFP supporters on 14 October 1992 at Empangeni, Natal, during political conflict in the area. Ms Biyela’s father, a prominent ANC member, was also killed in the attack.",
        "Had his house destroyed in an arson attack at KwaKhoza, KwaZulu, near Eshowe, Natal, during 1993, in political conflict between IFP and ANC supporters in the area.",
        "Had her livestock and possessions stolen during political conflict between ANC and IFP supporters in Zindophe, KwaZulu, near Eshowe, Natal, during March 1994. Her house was then destroyed.",
        "An IFP supporter who was stabbed and injured by ANC supporters in 1993 in KwaThema, Transvaal, during political conflict between hostel-dwellers and residents.",
        "Had her home destroyed in an arson attack at Mkhukhuze, KwaZulu, near Eshowe, Natal, in September 1993, in political conflict between IFP and ANC supporters in the area.",
        "An ANC supporter who was shot dead in Inanda, near KwaMashu, Durban, on 13 June 1993, in political conflict in the area.",
        "An ANC supporter who was left disabled after being shot and stabbed by IFP supporters near Empangeni, Natal, on 10 May 1994, the day of Nelson Mandela’s inauguration as President. The perpetrators stopped their car to attack Mr Biyela, apparently in a case of mistaken identity.",
        "Had her house burnt down by IFP supporters at Bukhanana, KwaMbonambi, near Richards Bay, Natal, on January 1994 after being accused of defecting to the ANC.",
        "Was shot and severely injured, allegedly by Khumalo gang members at a shebeen in Tokoza, Transvaal, on 13 December 1992. One other person was killed and another severely injured in this attack. Ms Biyela was paralysed as a result of the shooting, reportedly in retaliation for the shooting earlier in the day at the shebeen of a Khumalo gang member, allegedly involved in rape and murder.",
        "An ANC supporter who lost her home in an arson attack at Sundumbili, KwaZulu, near Mandini, Natal, on 23 March 1994, in political conflict between ANC and IFP supporters during the run-up to the April 1994 elections.",
        "Was shot and wounded when ANC security guards opened fire from the ANC headquarters at Shell House, Johannesburg, on a crowd of IFP marchers, on 28 March 1994. At least nine marchers were killed and around 100 injured. Ten ANC security guards were granted amnesty (AC/2000/142).",
        "Had her house destroyed in an arson attack by Inkatha supporters in Ntuzuma, near Durban, on 13 September 1988, in political conflict in the area.",
        "Had her home burnt down on 28 October 1992 in Ndaleni, Richmond, Natal, in ongoing political conflict between ANC and IFP supporters in the area.",
        "An ANC supporter who had her home burnt down by IFP supporters on 16 March 1994 in Sonkombo, Ndwedwe, KwaZulu, near Durban, in intense political conflict in the area. See Sonkombo arson attacks.",
        "Was shot dead in Mshayazafe hostel, Tokoza, Transvaal, on 21 March 1992, allegedly by IFP supporters who suspected him of spying for Phola Park residents. This incident occurred during political conflict between hostel-dwellers and residents.",
        "An ANC supporter who was shot and injured and lost his home in an arson attack by IFP supporters at Empangeni, Natal, on 14 October 1992. Mr Biyela’s daughter was killed in the attack.",
        "Had her house destroyed in an arson attack in Eshowe, Natal, during February 1994, in political conflict between ANC and IFP supporters in the area.",
        "An ANC supporter who had his house set alight by IFP supporters at Zindophe, KwaZulu, near Eshowe, Natal, in March 1994. Several homes belonging to ANC members were burnt down in the attack."
    ]
}
